In [1]:
import pandas as pd

In [3]:
my_series = pd.Series(["banana", 42, True, 3.14])

In [4]:
my_series

0    banana
1        42
2      True
3      3.14
dtype: object

In [7]:
my_series = pd.Series(["Wes", "Creator"], index=["person", "who"])
my_series

person        Wes
who       Creator
dtype: object

In [8]:
my_series.loc["person"]

'Wes'

In [10]:
my_series.iloc[0]

'Wes'

In [11]:
scientists = pd.DataFrame(
    data={'Occupation':['Chemist','Statistician'],
          'Born':['1920-07-25', '1876-06-13'],
          'Died':['1958-04-16', '1937-10-16'],
          'Age':[37,61]},
    index=['Rosaline Franklin','William Gosset'],
    columns=['Age', 'Occupation', 'Born','Died'])

In [12]:
scientists

                   Age    Occupation        Born        Died
Rosaline Franklin   37       Chemist  1920-07-25  1958-04-16
William Gosset      61  Statistician  1876-06-13  1937-10-16

In [14]:
scientists = pd.read_csv("data/scientists.csv")

In [15]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [19]:
ages = scientists["Age"]
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [20]:
ages = scientists.Age
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [21]:
scientists.shape

(8, 5)

In [22]:
type(ages)

pandas.core.series.Series

In [23]:
ages.describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [24]:
ages.mean()

np.float64(59.125)

In [26]:
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [28]:
ages.loc[ages > ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [29]:
ages.loc[ages > ages.mean() and ages > 75]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [30]:
ages.loc[ages > ages.mean() & ages > 75]

TypeError: Cannot perform 'rand_' with a dtyped [int64] array and scalar of type [bool]

In [31]:
ages.loc[(ages > ages.mean()) & (ages > 75)]

2    90
7    77
Name: Age, dtype: int64

In [32]:
ages.loc[(ages > ages.mean()) & ~(ages > 75)]

1    61
3    66
Name: Age, dtype: int64

In [33]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [34]:
scientists.loc[scientists.Age > scientists.Age.mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [35]:
scientists.loc[scientists.Age > scientists.Age.mean(), :]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [36]:
scientists.loc[scientists.Age > scientists.Age.mean(), ["Name", "Age"]]

                   Name  Age
1        William Gosset   61
2  Florence Nightingale   90
3           Marie Curie   66
7          Johann Gauss   77

In [37]:
scientists.loc[:, ["Name", "Age"]]

                   Name  Age
0     Rosaline Franklin   37
1        William Gosset   61
2  Florence Nightingale   90
3           Marie Curie   66
4         Rachel Carson   56
5             John Snow   45
6           Alan Turing   41
7          Johann Gauss   77

In [38]:
scientists.dtypes

Name          object
Born          object
Died          object
Age            int64
Occupation    object
dtype: object

In [39]:
pd.to_datetime(scientists["Born"], format="%Y-%m-%d")

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [40]:
scientists["born_dt"] = pd.to_datetime(scientists["Born"], format="%Y-%m-%d")

In [41]:
scientists

,Name,Born,Died,Age,Occupation,born_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30

In [43]:
scientists = scientists.assign(died_dt = pd.to_datetime(scientists["Died"], format="%Y-%m-%d"))

In [44]:
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [46]:
scientists.to_csv("scientists_clean.csv")

In [49]:
sci = pd.read_csv("scientists_clean.csv")
sci

,Unnamed: 0,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [50]:
scientists.to_csv("scientists_clean.csv", index=False)

In [51]:
sci = pd.read_csv("scientists_clean.csv")
sci

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [52]:
sci.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
 5   born_dt     8 non-null      object
 6   died_dt     8 non-null      object
dtypes: int64(1), object(6)
memory usage: 580.0+ bytes